Blog/app/controllers/post_controller.rb

  def index
	  @post =  Post.all
---
SELECT * FROM `posts`

  def create
	  @post=Post.new(params[:post])
	  @post.user_id = current_user.id
	  if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`, `user_id`) VALUES('2012-06-19 13:04:59', 'TRY', 'practice makes a man perfect', '2012-06-19 13:04:59', 1)

def show
	p "============="
	puts params.inspect
	@post = Post.find_by_id(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = '-610030268') LIMIT 1

  def ccreate
	  @post = Post.find(params[:id])
    @comment = @post.comments.create(params[:comment])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 16)
INSERT INTO `comments` (`name`, `created_at`, `body`, `updated_at`, `post_id`) VALUES('Armita', '2012-06-17 13:21:01', 'aaaaaaaaaaa', '2012-06-17 13:21:01', 16)