Blog/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = -617092738)
---
  def edit
	  @user=User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2012-06-25 18:28:43', `login` = 'kritika', `crypted_password` = 'ce91a1ff9eda504720805cc962aed3fcd9bea23a' WHERE `id` = 2
---
  def update
	  @user=User.find(params[:id])
         if @user.update_attributes(params[:user])

SELECT * FROM `t_zones` WHERE (`t_zones`.`description` = 'United States') LIMIT 1
INSERT INTO `t_zones` (`created_at`, `zone`, `updated_at`, `description`) VALUES('2012-06-18 18:29:58', 'International Date Line West', '2012-06-18 18:29:58', 'Pacific/Midway')
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `username`, `t_zone_id`, `lastname`, `firstname`, `remember_token`, `time_zone`, `login`, `email`) VALUES('08efba5a0ffce759a027ad8b4ae5403c81005efd', '2012-06-18 18:30:50', 'bc6b110c1b7e1880d89bb3a09da6579730317ce9', NULL, '2012-06-18 18:30:50', NULL, 4, 'singhaniya', 'sdfhmsgfgs', NULL, NULL, 'sweety', 'shrey@gmail.com')
SELECT * FROM `t_zones`
---
  def create

    logout_keeping_session!
    @user = User.new(params[:user])
    	  @timezone=TZone.find(:all)
             # @tim=  @user.t_zone_id
	     tzone =TZone.find_by_description(params[:tz])
	     @user.t_zone_id=tzone.id
    success = @user && @user.save
    @user.errors.each do |v|